app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.ratings
    if !session[:ratings]
      session[:ratings] = Movie.ratings_hash
    end

    if !params[:ratings]
      if params[:sort] == "title"
        session[:sort] = "title"
        @movies = Movie.find_all_by_rating(session[:ratings].keys, :order => "title")
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R', 'NC-17') ORDER BY release_date

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "13"]]
UPDATE "movies" SET "title" = 'Do not watch this movie', "rating" = 'NC-17', "updated_at" = '2013-10-10 02:30:32.538572' WHERE "movies"."id" = 13